import {memo} from "react";
import type { IUser } from "../../models/IUser";

type UserProps = {
    user:IUser
}

// оголошуємо компонент User, але замість звичайної функції ми передаємо її як аргумент у функцію memo
export const User = memo(({ user }: UserProps) => { // memo бере наш компонент і повертає його "розумну" копію. Тепер React перед кожним рендером буде порівнювати новий об'єкт user зі старим (який був у попередньому рендері). Якщо вони однакові — React повністю проігнорує рендер цього компонента і візьме вже готову HTML-розмітку з пам'яті (мемоізація)
    console.log('user'); // цей лог буде викликатися лише тоді, коли проп user зміниться (наприклад, при завантаженні нових даних або при зміні існуючих), але не при кожному рендері батьківського компонента Users
    return (
        <div>{user.name}</div> // Виводить Ім'я користувача
    );
});